<Qucs Schematic 0.0.19>
<Properties>
  <View=0,331,1471,1989,0.751317,0,120>
  <Grid=10,10,1>
  <DataSet=detector.dat>
  <DataDisplay=detector.dpl>
  <OpenDisplay=1>
  <Script=detector.m>
  <RunScript=0>
  <showFrame=0>
  <FrameText0=Название>
  <FrameText1=Чертил:>
  <FrameText2=Дата:>
  <FrameText3=Версия:>
</Properties>
<Symbol>
</Symbol>
<Components>
  <GND * 1 110 810 0 0 0 0>
  <Pac P1 1 110 720 -74 -26 1 1 "1" 1 "50 Ohm" 1 "20dBm" 0 "5.7GHz" 1 "26.85" 0>
  <GND * 1 310 900 0 0 0 0>
  <SUBST FR4 1 1050 480 -30 24 0 0 "4.2" 1 "0.8 mm" 1 "35 um" 1 "0.002" 1 "0.022e-6" 1 "1.4e-6" 1>
  <GND * 1 750 890 0 0 0 0>
  <Pac P2 1 750 760 -74 -26 1 1 "2" 1 "50 Ohm" 1 "20dBm" 0 "5.7GHz" 1 "26.85" 0>
  <Eqn Eqn1 1 1060 750 -28 15 0 0 "dBS21=dB(S[2,1])" 1 "ZofS22=rtoz(S[2,2])" 1 "yes" 0>
  <.DC DC1 1 1230 580 0 65 0 0 "26.85" 0 "0.001" 0 "1 pA" 0 "1 uV" 0 "no" 0 "150" 0 "no" 0 "none" 0 "CroutLU" 0>
  <.AC AC1 1 1220 360 0 65 0 0 "lin" 1 "5 GHz" 1 "6 GHz" 1 "101" 1 "no" 0>
  <Eqn Eqn2 1 920 780 -28 15 0 0 "dBS11=dB(S[1,1])" 1 "ZofS11=rtoz(S[1,1])" 1 "yes" 0>
  <.SP SP1 1 1240 720 0 69 0 0 "lin" 1 "5 GHz" 1 "6 GHz" 1 "11" 1 "no" 0 "1" 0 "2" 0 "no" 0 "no" 0>
  <SPfile X1 1 580 690 -26 -59 0 0 "C:/usr/seo-soft/!!HW-PROJECTS/ANTENNA/DETECTOR/Qucs/S2P/SERIES.s2p" 1 "rectangular" 0 "linear" 0 "open" 0 "2" 0>
  <GND * 1 580 720 0 0 0 0>
  <MLIN MSTC3 1 310 790 15 -26 0 1 "FR4" 1 "1.6mm" 1 "6.45mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0>
  <MLIN MSTC1 1 430 690 -26 15 0 0 "FR4" 1 "0.4mm" 1 "1.6mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0>
</Components>
<Wires>
  <110 750 110 810 "" 0 0 0 "">
  <750 790 750 890 "" 0 0 0 "">
  <610 690 750 690 "" 0 0 0 "">
  <750 690 750 730 "" 0 0 0 "">
  <460 690 550 690 "" 0 0 0 "">
  <110 690 310 690 "" 0 0 0 "">
  <310 690 400 690 "" 0 0 0 "">
  <310 690 310 760 "" 0 0 0 "">
  <310 820 310 900 "" 0 0 0 "">
</Wires>
<Diagrams>
  <Tab 68 1528 548 518 3 #c0c0c0 1 00 1 0 1 1 1 0 1 1 1 0 1 101 315 0 225 "" "" "">
	<"S[2,2]" #0000ff 0 3 1 0 0>
	<"ZofS22" #0000ff 0 3 0 0 0>
	<"ZofS11" #0000ff 0 3 0 0 0>
	<"dBS11" #0000ff 0 3 1 0 0>
  </Tab>
  <Smith 740 1518 585 585 3 #0055ff 1 00 1 0 1 1 1 0 4 1 1 0 1 1 315 0 225 "" "" "">
	<"S[2,2]" #00aa00 1 3 0 0 0>
	<"S[1,1]" #ff0000 2 3 0 0 0>
  </Smith>
</Diagrams>
<Paintings>
  <Text 160 1730 12 #000000 0 "1)Находите на сайте производителя файл s2p на конкретный усилитель,  \n2) Импортируете s2p в симулятор AWRDE или ADS или на худой конец в RFSim99 \n3) Выводите в симуляторе диаграмму Смита на несогласованный усилитель \nили графики частотной зависимости Z11=R11+jX11, Z22=R22+jX22 в интересующем диапазоне частот, \nпо ним определяете вид цепей согласования на входе и выходе. \n4) Рисуете в симуляторе схему с усилителем в виде блока с S-параметрами и с цепями согласования \n5) Выводите диаграмму Смита или частотные зависимости S11, S22 для схемы с цепями согласования \n6)Вручную или автоматически оптимизируете цепи согласования\n по критерию минимума S11 и S22 \n\nS21 есть коэффициент передачи напряжения падающей волны, \nпоэтому коэффициент передачи мощности G=|S21|^2">
</Paintings>
