<Qucs Schematic 0.0.19>
<Properties>
  <View=-52,221,1522,2392,0.683016,0,471>
  <Grid=10,10,1>
  <DataSet=detector.dat>
  <DataDisplay=detector.dpl>
  <OpenDisplay=1>
  <Script=detector.m>
  <RunScript=0>
  <showFrame=0>
  <FrameText0=Название>
  <FrameText1=Чертил:>
  <FrameText2=Дата:>
  <FrameText3=Версия:>
</Properties>
<Symbol>
</Symbol>
<Components>
  <VProbe Pr1 1 1000 730 28 -31 0 0>
  <GND * 1 1010 770 0 0 0 0>
  <C C1 1 800 820 17 -26 0 1 "100 pF" 1 "" 0 "neutral" 0>
  <GND * 1 860 850 0 0 0 0>
  <R R1 1 910 820 15 -26 0 1 "100kOhm" 1 "26.85" 0 "0.0" 0 "0.0" 0 "26.85" 0 "european" 0>
  <GND * 1 310 870 0 0 0 0>
  <GND * 1 110 850 0 0 0 0>
  <MLIN MSTC1 1 190 690 -26 15 0 0 "FR4" 1 "3 mm" 1 "12.58 mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0>
  <MLIN MSTC2 1 480 690 -26 15 0 0 "FR4" 1 "0.7 mm" 1 "2.7 mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0>
  <MLIN MSTC3 1 310 790 15 -26 0 1 "FR4" 1 "3 mm" 1 "6.29 mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0>
  <Pac P1 1 110 760 -74 -26 1 1 "1" 1 "50 Ohm" 1 "-5dBm" 0 "5.7GHz" 1 "26.85" 0>
  <.DC DC1 1 520 250 0 69 0 0 "26.85" 0 "0.001" 0 "1 pA" 0 "1 uV" 0 "no" 0 "150" 0 "no" 0 "none" 0 "CroutLU" 0>
  <.AC AC1 1 260 250 0 69 0 0 "lin" 1 "5.6 GHz" 1 "5.8 GHz" 1 "10" 1 "no" 0>
  <SUBST FR4 1 90 290 -30 24 0 0 "4.2" 1 "1.6 mm" 1 "35 um" 1 "0" 1 "2.43902e-08" 1 "0" 1>
  <.SP SP1 1 780 260 0 69 0 0 "lin" 1 "5.6 GHz" 1 "5.8 GHz" 1 "10" 1 "no" 0 "1" 0 "2" 0 "no" 0 "no" 0>
  <Eqn Eqn3 1 100 490 -38 16 0 0 "SWR=rtoswr(S[1,1])" 1 "yes" 0>
  <Eqn Eqn2 1 280 480 -28 15 0 0 "dBS11=dB(S[1,1])" 1 "ZofS11=rtoz(S[1,1])" 1 "yes" 0>
  <MTEE MS1 1 310 690 -26 -110 0 0 "FR4" 1 "3 mm" 1 "0.7 mm" 1 "3 mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0 "showNumbers" 0>
  <Diode SMS7630datasheet1 0 630 510 -26 -91 0 2 "5e-6 A" 1 "1.05" 1 "1.4e-13F" 1 "0.4" 0 "0.34 V" 0 "0.5" 0 "0.0 fF" 0 "0.0" 0 "2.0" 0 "20 Ohm" 0 "1e-11s" 0 "0" 0 "0.0" 0 "1.0" 0 "1.0" 0 "0" 0 "1e-4mA" 0 "26.85" 0 "2" 0 "0.69" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "27" 0 "1.0" 0 "Schottky" 0>
  <SPfile X1 1 580 690 -26 -59 0 0 "C:/usr/seo-soft/!!HW-PROJECTS/RF/DETECTOR/Qucs/S2P/SERIES.s2p" 1 "rectangular" 0 "linear" 0 "open" 0 "2" 0>
  <GND * 1 580 740 0 0 0 0>
</Components>
<Wires>
  <1010 750 1010 770 "" 0 0 0 "">
  <990 750 990 770 "" 0 0 0 "">
  <800 770 800 790 "" 0 0 0 "">
  <800 770 910 770 "" 0 0 0 "">
  <910 770 990 770 "" 0 0 0 "">
  <910 770 910 790 "" 0 0 0 "">
  <800 850 860 850 "" 0 0 0 "">
  <860 850 910 850 "" 0 0 0 "">
  <610 690 710 690 "" 0 0 0 "">
  <710 690 710 770 "" 0 0 0 "">
  <710 770 800 770 "" 0 0 0 "">
  <510 690 550 690 "" 0 0 0 "">
  <310 820 310 870 "" 0 0 0 "">
  <110 690 110 730 "" 0 0 0 "">
  <110 690 160 690 "" 0 0 0 "">
  <110 790 110 850 "" 0 0 0 "">
  <310 720 310 760 "" 0 0 0 "">
  <340 690 450 690 "" 0 0 0 "">
  <220 690 280 690 "" 0 0 0 "">
  <580 720 580 740 "" 0 0 0 "">
</Wires>
<Diagrams>
  <Smith 20 1498 585 585 3 #0055ff 1 00 1 0 1 1 1 0 4 1 1 0 1 1 315 0 225 "" "" "">
	<"S[1,1]" #ff0000 3 3 0 0 0>
  </Smith>
  <Rect 740 1445 672 495 3 #c0c0c0 1 00 1 5e+09 1e+08 6e+09 1 0.000507 1e-06 0.000519 1 -1 0.2 1 315 0 225 "" "" "">
	<"Pr1.v" #ff0000 2 3 0 0 0>
  </Rect>
  <Tab 413 1760 527 220 3 #c0c0c0 1 00 1 0 1 1 1 0 1 1 1 0 1 101 315 0 225 "" "" "">
	<"ZofS11" #0000ff 0 3 0 0 0>
	<"dBS11" #0000ff 0 3 1 0 0>
	<"SWR" #0000ff 0 3 0 0 0>
  </Tab>
</Diagrams>
<Paintings>
  <Text 70 2140 12 #000000 0 "1)Находите на сайте производителя файл s2p на конкретный усилитель,  \n2) Импортируете s2p в симулятор AWRDE или ADS или на худой конец в RFSim99 \n3) Выводите в симуляторе диаграмму Смита на несогласованный усилитель \nили графики частотной зависимости Z11=R11+jX11, Z22=R22+jX22 в интересующем диапазоне частот, \nпо ним определяете вид цепей согласования на входе и выходе. \n4) Рисуете в симуляторе схему с усилителем в виде блока с S-параметрами и с цепями согласования \n5) Выводите диаграмму Смита или частотные зависимости S11, S22 для схемы с цепями согласования \n6)Вручную или автоматически оптимизируете цепи согласования\n по критерию минимума S11 и S22 \n\nS21 есть коэффициент передачи напряжения падающей волны, \nпоэтому коэффициент передачи мощности G=|S21|^2">
</Paintings>
