<Qucs Schematic 0.0.19>
<Properties>
  <View=-329,-589,1453,1264,0.909092,0,300>
  <Grid=10,10,1>
  <DataSet=HSMS-286.dat>
  <DataDisplay=HSMS-286.dpl>
  <OpenDisplay=1>
  <Script=HSMS-286.m>
  <RunScript=0>
  <showFrame=0>
  <FrameText0=Название>
  <FrameText1=Чертил:>
  <FrameText2=Дата:>
  <FrameText3=Версия:>
</Properties>
<Symbol>
</Symbol>
<Components>
  <.DC DC1 0 240 -560 0 69 0 0 "26.85" 0 "0.001" 0 "1 pA" 0 "1 uV" 0 "no" 0 "150" 0 "no" 0 "none" 0 "CroutLU" 0>
  <.AC AC1 0 -20 -560 0 69 0 0 "lin" 1 "5.6 GHz" 1 "5.8 GHz" 1 "10" 1 "no" 0>
  <Eqn Eqn1 1 -180 -320 -38 16 0 0 "SWR=rtoswr(S[1,1])" 1 "yes" 0>
  <Eqn Eqn2 1 0 -330 -28 15 0 0 "dBS11=dB(S[1,1])" 1 "ZofS11=rtoz(S[1,1])" 1 "yes" 0>
  <.SP SP1 1 530 -560 0 69 0 0 "lin" 1 "1 GHz" 1 "6 GHz" 1 "50" 1 "no" 0 "1" 0 "2" 0 "no" 0 "no" 0>
  <MTEE MSS1 0 880 -440 -26 -110 0 0 "FR4" 1 "2.47 mm" 1 "2.47 mm" 1 "2.47 mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0 "showNumbers" 0>
  <SUBST FR4 1 -190 -520 -30 24 0 0 "4.2" 1 "0.8 mm" 1 "35 um" 1 "0.002" 1 "2.43902e-08" 1 "0" 1>
  <Diode HSMS1 0 870 -260 -26 -91 0 2 "5e-8 A" 1 "1.08" 1 "0.18pF" 1 "0.5" 0 "0.65 V" 0 "0.5" 0 "0.0 fF" 0 "0.0" 0 "2.0" 0 "6 Ohm" 0 "1e-11s" 0 "0" 0 "0.0" 0 "1.0" 0 "1.0" 0 "0" 0 "1e-5A" 0 "26.85" 0 "2" 0 "0.69" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "27" 0 "1.0" 0 "Schottky" 0>
  <Pac P1 1 -250 -10 -74 -26 1 1 "1" 1 "50 Ohm" 1 "0dBm" 0 "5.7GHz" 1 "26.85" 0>
  <GND * 1 -250 80 0 0 0 0>
  <Pac P2 1 -20 -60 -74 -26 1 1 "2" 1 "50 Ohm" 1 "0dBm" 0 "5.7GHz" 1 "26.85" 0>
  <GND * 1 -20 -30 0 0 0 0>
  <GND * 1 -160 -90 0 0 0 0>
  <SPfile X5 0 20 -210 -26 -41 0 0 "C:/usr/seo-soft/!!HW-PROJECTS/RF/DETECTOR/Qucs/S2P/ONEPORT.s1p" 0 "rectangular" 0 "linear" 0 "open" 0 "1" 0>
  <SPfile X4 1 -160 -120 -26 -41 0 0 "C:/usr/seo-soft/!!HW-PROJECTS/RF/DETECTOR/Qucs/S2P/SERIES.s2p" 0 "rectangular" 0 "linear" 0 "open" 0 "2" 0>
  <GND * 1 -100 -120 0 0 0 0>
</Components>
<Wires>
  <-250 20 -250 80 "" 0 0 0 "">
  <-250 -120 -250 -40 "" 0 0 0 "">
  <-250 -120 -190 -120 "" 0 0 0 "">
  <-130 -120 -100 -120 "" 0 0 0 "">
  <-20 -120 -20 -90 "" 0 0 0 "">
  <-100 -120 -20 -120 "" 0 0 0 "">
</Wires>
<Diagrams>
  <Smith 197 233 589 589 3 #0055ff 1 00 1 0 1 1 1 0 4 1 1 0 1 1 315 0 225 "" "" "">
	<"S[1,1]" #ff0000 3 3 0 0 0>
  </Smith>
  <Tab -277 350 527 220 3 #c0c0c0 1 00 1 40 1 1 1 0 1 1 1 0 1 50 315 0 225 "" "" "">
	<"ZofS11" #0000ff 0 3 0 0 0>
	<"dBS11" #0000ff 0 3 1 0 0>
	<"SWR" #0000ff 0 3 0 0 0>
  </Tab>
</Diagrams>
<Paintings>
  <Text -200 1020 12 #000000 0 "1)Находите на сайте производителя файл s2p на конкретный усилитель,  \n2) Импортируете s2p в симулятор AWRDE или ADS или на худой конец в RFSim99 \n3) Выводите в симуляторе диаграмму Смита на несогласованный усилитель \nили графики частотной зависимости Z11=R11+jX11, Z22=R22+jX22 в интересующем диапазоне частот, \nпо ним определяете вид цепей согласования на входе и выходе. \n4) Рисуете в симуляторе схему с усилителем в виде блока с S-параметрами и с цепями согласования \n5) Выводите диаграмму Смита или частотные зависимости S11, S22 для схемы с цепями согласования \n6)Вручную или автоматически оптимизируете цепи согласования\n по критерию минимума S11 и S22 \n\nS21 есть коэффициент передачи напряжения падающей волны, \nпоэтому коэффициент передачи мощности G=|S21|^2">
</Paintings>
