<Qucs Schematic 0.0.19>
<Properties>
  <View=-329,-589,1453,1291,0.620922,0,180>
  <Grid=10,10,1>
  <DataSet=HSMS-286.dat>
  <DataDisplay=HSMS-286.dpl>
  <OpenDisplay=1>
  <Script=HSMS-286.m>
  <RunScript=0>
  <showFrame=0>
  <FrameText0=Название>
  <FrameText1=Чертил:>
  <FrameText2=Дата:>
  <FrameText3=Версия:>
</Properties>
<Symbol>
</Symbol>
<Components>
  <VProbe Pr1 1 720 -80 28 -31 0 0>
  <GND * 1 730 -40 0 0 0 0>
  <C C1 1 520 10 17 -26 0 1 "100 pF" 1 "" 0 "neutral" 0>
  <GND * 1 580 40 0 0 0 0>
  <R R1 1 630 10 15 -26 0 1 "100kOhm" 1 "26.85" 0 "0.0" 0 "0.0" 0 "26.85" 0 "european" 0>
  <GND * 1 -170 40 0 0 0 0>
  <.DC DC1 1 240 -560 0 69 0 0 "26.85" 0 "0.001" 0 "1 pA" 0 "1 uV" 0 "no" 0 "150" 0 "no" 0 "none" 0 "CroutLU" 0>
  <.AC AC1 1 -20 -560 0 69 0 0 "lin" 1 "5.6 GHz" 1 "5.8 GHz" 1 "10" 1 "no" 0>
  <SUBST FR4 1 -190 -520 -30 24 0 0 "4.2" 1 "0.8 mm" 1 "35 um" 1 "0" 1 "2.43902e-08" 1 "0" 1>
  <Eqn Eqn1 1 -180 -320 -38 16 0 0 "SWR=rtoswr(S[1,1])" 1 "yes" 0>
  <Eqn Eqn2 1 0 -330 -28 15 0 0 "dBS11=dB(S[1,1])" 1 "ZofS11=rtoz(S[1,1])" 1 "yes" 0>
  <.SP SP1 1 530 -560 0 69 0 0 "lin" 1 "1 GHz" 1 "5.8 GHz" 1 "10" 1 "no" 0 "1" 0 "2" 0 "no" 0 "no" 0>
  <Eqn Eqn3 1 170 -320 -38 16 0 0 "outV=Pr1.v" 1 "yes" 0>
  <MTEE MSS1 0 880 -440 -26 -110 0 0 "FR4" 1 "2.47 mm" 1 "2.47 mm" 1 "2.47 mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0 "showNumbers" 0>
  <GND * 1 390 -110 0 0 0 0>
  <MLIN MS1 1 160 -110 -26 15 0 0 "FR4" 1 "0.406mm" 1 "0.94mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0>
  <Diode HSMS286 1 310 -110 -26 -91 0 2 "5e-8 A" 1 "1.08" 1 "0.18pF" 1 "0.5" 0 "0.65 V" 0 "0.5" 0 "0.0 fF" 0 "0.0" 0 "2.0" 0 "6 Ohm" 0 "1e-11s" 0 "0" 0 "0.0" 0 "1.0" 0 "1.0" 0 "0" 0 "1e-5A" 0 "26.85" 0 "2" 0 "0.69" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "0.0" 0 "27" 0 "1.0" 0 "Schottky" 0>
  <MLIN MS2 1 -40 0 15 -26 0 1 "FR4" 1 "1.143mm" 1 "1.854mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0>
  <GND * 1 -40 50 0 0 0 0>
  <Pac P1 1 -170 -50 -74 -26 1 1 "1" 1 "50 Ohm" 1 "0dBm" 0 "5.7GHz" 1 "26.85" 0>
  <MTEE MS3 1 -40 -120 -26 -110 0 0 "FR4" 1 "1 mm" 1 "0.406 mm" 1 "1.143 mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0 "showNumbers" 0>
  <MLIN MS4 1 -160 -160 -26 15 0 0 "FR4" 1 "0.406mm" 1 "0.01mm" 1 "Hammerstad" 0 "Kirschning" 0 "26.85" 0>
</Components>
<Wires>
  <730 -60 730 -40 "" 0 0 0 "">
  <710 -60 710 -40 "" 0 0 0 "">
  <520 -40 520 -20 "" 0 0 0 "">
  <520 -40 630 -40 "" 0 0 0 "">
  <630 -40 710 -40 "" 0 0 0 "">
  <630 -40 630 -20 "" 0 0 0 "">
  <520 40 580 40 "" 0 0 0 "">
  <580 40 630 40 "" 0 0 0 "">
  <-170 -20 -170 40 "" 0 0 0 "">
  <190 -110 280 -110 "" 0 0 0 "">
  <340 -110 390 -110 "" 0 0 0 "">
  <-40 30 -40 50 "" 0 0 0 "">
  <130 -120 130 -110 "" 0 0 0 "">
  <-10 -120 130 -120 "" 0 0 0 "">
  <-40 -90 -40 -30 "" 0 0 0 "">
  <-130 -120 -70 -120 "" 0 0 0 "">
  <-130 -160 -130 -120 "" 0 0 0 "">
  <-190 -160 -190 -80 "" 0 0 0 "">
  <-190 -80 -170 -80 "" 0 0 0 "">
</Wires>
<Diagrams>
  <Smith -260 688 585 585 3 #0055ff 1 00 1 0 1 1 1 0 4 1 1 0 1 1 315 0 225 "" "" "">
	<"S[1,1]" #ff0000 3 3 0 0 0>
  </Smith>
  <Rect 460 635 672 495 3 #c0c0c0 1 00 1 5.6e+09 2e+07 5.8e+09 1 8.8778e-06 5e-07 1.35e-05 1 -1 0.2 1 315 0 225 "" "" "">
	<"outV" #0000ff 3 3 0 0 0>
  </Rect>
  <Tab 133 950 527 220 3 #c0c0c0 1 00 1 0 1 1 1 0 1 1 1 0 1 101 315 0 225 "" "" "">
	<"ZofS11" #0000ff 0 3 0 0 0>
	<"dBS11" #0000ff 0 3 1 0 0>
	<"SWR" #0000ff 0 3 0 0 0>
  </Tab>
</Diagrams>
<Paintings>
  <Text -200 1020 12 #000000 0 "1)Находите на сайте производителя файл s2p на конкретный усилитель,  \n2) Импортируете s2p в симулятор AWRDE или ADS или на худой конец в RFSim99 \n3) Выводите в симуляторе диаграмму Смита на несогласованный усилитель \nили графики частотной зависимости Z11=R11+jX11, Z22=R22+jX22 в интересующем диапазоне частот, \nпо ним определяете вид цепей согласования на входе и выходе. \n4) Рисуете в симуляторе схему с усилителем в виде блока с S-параметрами и с цепями согласования \n5) Выводите диаграмму Смита или частотные зависимости S11, S22 для схемы с цепями согласования \n6)Вручную или автоматически оптимизируете цепи согласования\n по критерию минимума S11 и S22 \n\nS21 есть коэффициент передачи напряжения падающей волны, \nпоэтому коэффициент передачи мощности G=|S21|^2">
</Paintings>
